NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include "version_handler.h"

#include "transport_control.h"
#include "timeslot_handler.h"
#include "timer_control.h"
#include "event_handler.h"
#include "rbc_mesh_common.h"
#include "toolchain.h"
#include "trickle.h"
#include "rbc_mesh.h"
#include "mesh_packet.h"
#include "mesh_aci.h"

#include "SEGGER_RTT.h"

#include "nrf_error.h"
#include "app_error.h"
#include "fifo.h"
#include <stdlib.h>
#include <stddef.h>
#include <string.h>

#define MESH_TRICKLE_I_MAX              (2048)
#define MESH_TRICKLE_K                  (3)

#define MESH_VALUE_LOLLIPOP_LIMIT       (200)

#define TIMESLOT_STARTUP_DELAY_US       (100)

#define HANDLE_CACHE_ENTRY_INVALID      (RBC_MESH_HANDLE_CACHE_ENTRIES)
#define DATA_CACHE_ENTRY_INVALID        (RBC_MESH_DATA_CACHE_ENTRIES)

#define CACHE_TASK_FIFO_SIZE            (8)

#define HANDLE_CACHE_ITERATE(index)     do { index = m_handle_cache[index].index_next; } while (0)
#define HANDLE_CACHE_ITERATE_BACK(index)     do { index = m_handle_cache[index].index_prev; } while (0)
/* event push isn't present in the API header file. */
extern uint32_t rbc_mesh_event_push(rbc_mesh_event_t* p_evt);

/******************************************************************************
* Local typedefs
******************************************************************************/
typedef struct
{
    rbc_mesh_value_handle_t handle;             /** data handle */
    uint16_t                version;            /** last received handle version */
    uint16_t                index_next : 15;    /** linked list index next */
    uint16_t                tx_event   : 1;     /** TX event flag */
    uint16_t                index_prev : 15;    /** linked list index prev */
    uint16_t                persistent : 1;     /** Persistent flag */
    uint16_t                data_entry;         /** index of the associated data entry */
} handle_entry_t;

typedef struct
{
    trickle_t trickle;
    mesh_packet_t* p_packet;
} data_entry_t;

typedef enum
{
    CACHE_TASK_TYPE_ENABLE,
    CACHE_TASK_TYPE_LOCAL_UPDATE
} cache_task_type_t;

typedef struct
{
    cache_task_type_t type;
    rbc_mesh_value_handle_t handle;
    union
    {
        struct
        {
            mesh_packet_t* p_packet;
        } enable;
        struct
        {
            mesh_packet_t* p_packet;
        } local_update;
    } params;
} cache_task_t;
/******************************************************************************
* Static globals
******************************************************************************/
static handle_entry_t   m_handle_cache[RBC_MESH_HANDLE_CACHE_ENTRIES];
static data_entry_t     m_data_cache[RBC_MESH_DATA_CACHE_ENTRIES];
static uint32_t         m_handle_cache_head;
static uint32_t         m_handle_cache_tail;
static bool             m_is_initialized = false;
static fifo_t           m_task_fifo;
static cache_task_t     m_task_fifo_buffer[CACHE_TASK_FIFO_SIZE];
static bool             m_handle_task_scheduled;

#ifdef DEBUG
static uint16_t m_cache_altering_log[16];
static uint8_t m_cache_alter_pointer = 0;
#endif
/******************************************************************************
* Static functions
******************************************************************************/
#ifdef DEBUG
static void log_cache_access(uint16_t line)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    m_cache_altering_log[(m_cache_alter_pointer++) & 0x0F] = line;
    m_cache_altering_log[(m_cache_alter_pointer) & 0x0F] = 0; // to easily locate latest.
    _ENABLE_IRQS(was_masked);
}

static void print_cache_log(void)
{
    SEGGER_RTT_WriteString(0, "CACHE LOG:\n");
    for (uint8_t i = 0; i < 16; ++i)
    {
        SEGGER_RTT_printf(0, "\t%d\n", m_cache_altering_log[(m_cache_alter_pointer + i) & 0x0F]);
    }
}

static void validate_cache(void)
{ 
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    APP_ERROR_CHECK_BOOL(m_handle_cache[m_handle_cache_tail].index_next == HANDLE_CACHE_ENTRY_INVALID);
    APP_ERROR_CHECK_BOOL(m_handle_cache[m_handle_cache_head].index_prev == HANDLE_CACHE_ENTRY_INVALID);
    for (uint32_t i = 0; i < RBC_MESH_HANDLE_CACHE_ENTRIES; ++i)
    {
        if (i != m_handle_cache_head)
        {
            if (m_handle_cache[i].index_prev == HANDLE_CACHE_ENTRY_INVALID)
            {
                print_cache_log();
                APP_ERROR_CHECK_BOOL(false);
            }
        }
        if (i != m_handle_cache_tail)
        {
            if (m_handle_cache[i].index_next == HANDLE_CACHE_ENTRY_INVALID)
            {
                print_cache_log();
                APP_ERROR_CHECK_BOOL(false);
            }
        }
    }
    
    for (uint32_t count = 0, i = m_handle_cache_head; count < RBC_MESH_HANDLE_CACHE_ENTRIES - 1; i = m_handle_cache[i].index_next, count++)
    {
        if (m_handle_cache[i].index_next == HANDLE_CACHE_ENTRY_INVALID)
        {
            print_cache_log();
            APP_ERROR_CHECK_BOOL(false);
        }
    }
    _ENABLE_IRQS(was_masked);
}
#endif    


static void version_increment(uint16_t* version)
{
    if (*version == UINT16_MAX)
    {
        *version = MESH_VALUE_LOLLIPOP_LIMIT;
    }
    else
    {
        (*version)++;
    }
}

