NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
static void data_entry_free(data_entry_t* p_data_entry)
{
    if (p_data_entry == NULL)
        return;

    if (p_data_entry->p_packet != NULL)
    {
        mesh_packet_ref_count_dec(p_data_entry->p_packet); /* data cache ref remove */
        p_data_entry->p_packet = NULL;
    }
    /* reset trickle params */
    trickle_enable(&p_data_entry->trickle);
}

/** Allocate a new data entry. Will take the least recently updated entry if all are allocated.
  Returns the index of the resulting entry. */
static uint16_t data_entry_allocate(void)
{
    static uint16_t allocated = 0;
    /** @TODO: Can this bit be removed when all entries are allocated?*/
    for (uint32_t i = allocated; i < RBC_MESH_DATA_CACHE_ENTRIES; ++i)
    {
        if (m_data_cache[i].p_packet == NULL)
        {
            trickle_timer_reset(&m_data_cache[i].trickle, 0);
            allocated++;
            return i;
        }
    }

    /* no unused entries, take the least recently updated (and disregard persistent handles) */
    uint32_t handle_index = m_handle_cache_tail;
    while (m_handle_cache[handle_index].data_entry == DATA_CACHE_ENTRY_INVALID ||
            m_handle_cache[handle_index].persistent)
    {
        HANDLE_CACHE_ITERATE_BACK(handle_index);
        
        if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
        {
            return DATA_CACHE_ENTRY_INVALID;
        }
    }

    uint32_t data_index = m_handle_cache[handle_index].data_entry;

    /* cleanup */
    m_handle_cache[handle_index].data_entry = DATA_CACHE_ENTRY_INVALID;

    data_entry_free(&m_data_cache[data_index]);
    return data_index;
}

/** Get the index of the handle entry representing the given handle.
  Returns HANDLE_CACHE_ENTRY_INVALID if not found */
static uint16_t handle_entry_get(rbc_mesh_value_handle_t handle)
{
    event_handler_critical_section_begin();
    uint16_t i = m_handle_cache_head;

    while (m_handle_cache[i].handle != handle)
    {
        if (m_handle_cache_tail == i)
        {
            event_handler_critical_section_end();
            return HANDLE_CACHE_ENTRY_INVALID; /* checked all entries */
        }
        HANDLE_CACHE_ITERATE(i);
    }
    
    event_handler_critical_section_end();
    return i;
}

/** Moves the given handle to the head of the handle cache.
  If it doesn't exist, it allocates the tail, and moves it to head.
  Returns the index in the cache, or HANDLE_CACHE_ENTRY_INVALID if the cache
  is full of persistent handles */
static uint16_t handle_entry_to_head(rbc_mesh_value_handle_t handle)
{
    uint16_t i = handle_entry_get(handle);
    if (i == HANDLE_CACHE_ENTRY_INVALID)
    {
        i = m_handle_cache_tail;
        while (m_handle_cache[i].persistent)
        {
            HANDLE_CACHE_ITERATE_BACK(i);
            if (i == HANDLE_CACHE_ENTRY_INVALID)
            {
                return i; /* reached the head without hitting a non-persistent handle */
            }
        }
        /* clean up old data */
        m_handle_cache[i].handle = handle;
        m_handle_cache[i].tx_event = 0;
        m_handle_cache[i].version = 0;
        if (m_handle_cache[i].data_entry != DATA_CACHE_ENTRY_INVALID)
        {
            data_entry_free(&m_data_cache[m_handle_cache[i].data_entry]);
            m_handle_cache[i].data_entry = DATA_CACHE_ENTRY_INVALID;
        }
    }
    /* detach and move to head */
    if (i != m_handle_cache_tail)
    {
        if (i != m_handle_cache_head)
        {
            m_handle_cache[m_handle_cache[i].index_next].index_prev = m_handle_cache[i].index_prev;
        }
    }
    else
    {
        m_handle_cache_tail = m_handle_cache[i].index_prev;
        m_handle_cache[i].index_next = HANDLE_CACHE_ENTRY_INVALID;
    }

    if (i != m_handle_cache_head)
    {
        if (m_handle_cache[i].index_prev != HANDLE_CACHE_ENTRY_INVALID)
        {
            m_handle_cache[m_handle_cache[i].index_prev].index_next = m_handle_cache[i].index_next;
        }

        m_handle_cache[i].index_prev = HANDLE_CACHE_ENTRY_INVALID;
        m_handle_cache[i].index_next = m_handle_cache_head;
        m_handle_cache[m_handle_cache_head].index_prev = i;
        m_handle_cache_head = i;
    }
    
    m_handle_cache[m_handle_cache_head].index_prev = HANDLE_CACHE_ENTRY_INVALID;
    m_handle_cache[m_handle_cache_tail].index_next = HANDLE_CACHE_ENTRY_INVALID;
    
    return i;
}

/** Find or allocate the given handle, and give it a value.
  Returns the index of the handle in the cache */
static uint16_t handle_version_set(rbc_mesh_value_handle_t handle,
        uint16_t version,
        bool* cache_hit,
        int16_t* delta)
{
    uint16_t i = handle_entry_to_head(handle);
    if (i == HANDLE_CACHE_ENTRY_INVALID)
    {
        APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    *delta = vh_get_version_delta(m_handle_cache[i].version, version);
    *cache_hit = (m_handle_cache[i].version > 0);

    if (*delta > 0)
    {
        m_handle_cache[i].version = version;
    }
    
    return i;
}

/** Find or allocate the given handle in the cache, and increment the version.
  Returns the index of the handle in the cache. */
static uint16_t handle_version_increment(rbc_mesh_value_handle_t handle)
{
    uint16_t i = handle_entry_to_head(handle);
    if (i == HANDLE_CACHE_ENTRY_INVALID)
    {
        APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    version_increment(&m_handle_cache[i].version);

    return i;
}

static void transmit_all_instances(uint64_t timestamp);

static void order_next_transmission(uint64_t time_now)
{
    uint64_t ts_begin_time = timeslot_get_global_time();
    uint64_t ts_end_time = timeslot_get_end_time();
    uint64_t earliest = UINT64_MAX;
    uint16_t handle_index = m_handle_cache_head;
    do
    {
        uint16_t data_index = m_handle_cache[handle_index].data_entry;
        if (data_index < DATA_CACHE_ENTRY_INVALID &&
            m_data_cache[data_index].p_packet != NULL &&
            m_data_cache[data_index].trickle.t < earliest
        )
        {
            earliest = m_data_cache[data_index].trickle.t;
        }

        HANDLE_CACHE_ITERATE(handle_index);

    } while (handle_index != m_handle_cache_tail && handle_index != HANDLE_CACHE_ENTRY_INVALID);
    
    if (earliest < ts_end_time)
    {
        timer_order_cb(TIMER_INDEX_VH, earliest - ts_begin_time, transmit_all_instances);
    }
}

static void transmit_all_instances(uint64_t timestamp)
{
    /* the framework continues where it left off */
    static uint16_t data_index = 0;

    uint64_t ts_begin_time = timeslot_get_global_time();

    for (uint32_t i = 0; i < RBC_MESH_DATA_CACHE_ENTRIES; ++i)
    {
        while (data_index >= RBC_MESH_DATA_CACHE_ENTRIES)
            data_index -= RBC_MESH_DATA_CACHE_ENTRIES;

        if ((m_data_cache[data_index].p_packet != NULL) &&
            (m_data_cache[data_index].trickle.t <= timestamp + ts_begin_time))
        {
            bool do_tx = false;
            trickle_tx_timeout(&m_data_cache[data_index].trickle, &do_tx, timestamp + ts_begin_time);
            if (do_tx)
            {
                uint32_t error_code = tc_tx(m_data_cache[data_index].p_packet);

                if (error_code == NRF_SUCCESS)
                {
                    /* the handle is queued for transmission */
                    trickle_tx_register(&m_data_cache[data_index].trickle);
                }
                else
                {
                    /* the radio queue is full, tc will notify us when it's available again */
                    TICK_PIN(PIN_TC_QUEUE_FULL);
                    break;
                }
            }
        }
        data_index++;
    }
    
    order_next_transmission(timestamp);
}

/** compare payloads, assuming version number is equal */
static bool payload_has_conflict(mesh_adv_data_t* p_old_adv, mesh_adv_data_t* p_new_adv)
{
    if (p_old_adv == NULL ||
        p_new_adv == NULL ||
        (p_old_adv->adv_data_length !=
        p_new_adv->adv_data_length))
    {
        return true;
    }

