NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
    return (memcmp(p_old_adv->data, p_new_adv->data, p_old_adv->adv_data_length - MESH_PACKET_ADV_OVERHEAD) != 0);
}

static void cache_task_handle_enable(rbc_mesh_value_handle_t handle, mesh_packet_t* p_packet)
{
    const uint64_t ts_time = timer_get_timestamp();
    const uint64_t time_now = ts_time + timeslot_get_global_time();
    uint16_t handle_index = handle_entry_to_head(handle);
    uint16_t data_index = m_handle_cache[handle_index].data_entry;

    if (data_index == DATA_CACHE_ENTRY_INVALID)
    {
        data_index = data_entry_allocate();
        
        APP_ERROR_CHECK_BOOL(data_index != DATA_CACHE_ENTRY_INVALID);

        m_handle_cache[handle_index].data_entry = data_index;
        trickle_timer_reset(&m_data_cache[data_index].trickle, time_now);
        m_data_cache[data_index].p_packet = p_packet;
    }
    else
    {
        if (m_data_cache[data_index].p_packet != NULL)
        {
            mesh_packet_ref_count_dec(p_packet); /* didn't need the dummy packet after all, we already had one */
        }
        else
        {            
            m_data_cache[data_index].p_packet = p_packet;
        }
        
        trickle_enable(&m_data_cache[data_index].trickle);
    }

    vh_order_update(ts_time);
}

static void cache_task_handle_local_update(rbc_mesh_value_handle_t handle, mesh_packet_t* p_packet)
{
    const uint64_t ts_time = timer_get_timestamp();
    const uint64_t time_now = ts_time + timeslot_get_global_time();
    const uint16_t handle_index = handle_version_increment(handle);
    uint16_t data_index = m_handle_cache[handle_index].data_entry;

    if (data_index == DATA_CACHE_ENTRY_INVALID)
    {
        data_index = data_entry_allocate();
        APP_ERROR_CHECK_BOOL(data_index != DATA_CACHE_ENTRY_INVALID);
        
        m_handle_cache[handle_index].data_entry = data_index;
    }
    else if (m_data_cache[data_index].p_packet != NULL)
    {
        mesh_packet_ref_count_dec(m_data_cache[data_index].p_packet);
    }
    
    /* set the version number in the packet, as we now know it. */
    mesh_adv_data_t* p_adv_data = mesh_packet_adv_data_get(p_packet);
    APP_ERROR_CHECK_BOOL(p_adv_data != NULL);
    p_adv_data->version = m_handle_cache[handle_index].version;
    
    m_data_cache[data_index].p_packet = p_packet;

    trickle_enable(&m_data_cache[data_index].trickle);

    if (m_handle_cache[handle_index].version == 1) /* first update */
    {
        trickle_timer_reset(&m_data_cache[data_index].trickle, time_now);
    }
    else
    {
        trickle_rx_inconsistent(&m_data_cache[data_index].trickle, time_now);
    }

    vh_order_update(ts_time);
}

static void handle_task_queue(void)
{
    m_handle_task_scheduled = false;
    
    cache_task_t task;
    while (fifo_pop(&m_task_fifo, &task) == NRF_SUCCESS)
    {
        switch (task.type)
        {
            case CACHE_TASK_TYPE_ENABLE:
                cache_task_handle_enable(task.handle, task.params.enable.p_packet);
                break;
            
            case CACHE_TASK_TYPE_LOCAL_UPDATE:
                cache_task_handle_local_update(task.handle, task.params.local_update.p_packet);
                break;
        }
    }
}

static uint32_t handle_task_push(cache_task_t* p_task)
{
    uint32_t error_code = fifo_push(&m_task_fifo, p_task);
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    
    if (true || !m_handle_task_scheduled)
    {
        async_event_t evt;
        evt.type = EVENT_TYPE_GENERIC;
        evt.callback.generic = handle_task_queue;
        error_code = event_handler_push(&evt);
        if (error_code == NRF_SUCCESS)
        {
            m_handle_task_scheduled = true; /* we may have a double-schedule here, but it doesn't really matter */
        }
    }
    
    return error_code;
}
/******************************************************************************
* Interface functions
******************************************************************************/
uint32_t vh_init(uint32_t min_interval_us)
{
    uint32_t error_code = vh_min_interval_set(min_interval_us);
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }

    for (uint32_t i = 0; i < RBC_MESH_DATA_CACHE_ENTRIES; ++i)
    {
        trickle_timer_reset(&m_data_cache[i].trickle, 0);
        m_data_cache[i].p_packet = NULL;
    }

    for (uint32_t i = 0; i < RBC_MESH_HANDLE_CACHE_ENTRIES; ++i)
    {
        m_handle_cache[i].handle = RBC_MESH_INVALID_HANDLE;
        m_handle_cache[i].version = 0;
        m_handle_cache[i].persistent = 0;
        m_handle_cache[i].tx_event = 0;
        m_handle_cache[i].data_entry = DATA_CACHE_ENTRY_INVALID;
        m_handle_cache[i].index_prev = i - 1;
        m_handle_cache[i].index_next = i + 1;
    }
    
    m_handle_cache_head = 0;
    m_handle_cache_tail = RBC_MESH_HANDLE_CACHE_ENTRIES - 1;
    m_handle_cache[m_handle_cache_head].index_prev = HANDLE_CACHE_ENTRY_INVALID;
    m_handle_cache[m_handle_cache_tail].index_next = HANDLE_CACHE_ENTRY_INVALID;
    
    m_task_fifo.array_len = CACHE_TASK_FIFO_SIZE;
    m_task_fifo.elem_array = m_task_fifo_buffer;
    m_task_fifo.elem_size = sizeof(cache_task_t);
    m_task_fifo.memcpy_fptr = NULL;
    fifo_init(&m_task_fifo);
    m_handle_task_scheduled = false;
    m_is_initialized = true;
    return NRF_SUCCESS;
}

uint32_t vh_min_interval_set(uint32_t min_interval_us)
{
    if (min_interval_us < RBC_MESH_INTERVAL_MIN_MIN_MS * 1000 ||
        min_interval_us > RBC_MESH_INTERVAL_MIN_MAX_MS * 1000)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    trickle_setup(min_interval_us, MESH_TRICKLE_I_MAX, MESH_TRICKLE_K);

    return NRF_SUCCESS;
}

vh_data_status_t vh_rx_register(mesh_adv_data_t* p_adv_data, uint64_t timestamp)
{
    if (!m_is_initialized)
        return VH_DATA_STATUS_UNKNOWN;

    mesh_packet_t* p_packet = mesh_packet_get_aligned(p_adv_data);
    if (p_packet == NULL)
    {
        return VH_DATA_STATUS_UNKNOWN;
    }

    bool cache_hit = false;
    int16_t delta = 0;
    uint16_t handle_index = handle_version_set(p_adv_data->handle, p_adv_data->version, &cache_hit, &delta);
    uint16_t data_index = m_handle_cache[handle_index].data_entry;
    uint64_t ts_start_time = timeslot_get_global_time();

    if (delta < 0)
    {
        /* the incoming packet is old */
        if (data_index != DATA_CACHE_ENTRY_INVALID)
        {
            trickle_rx_inconsistent(&m_data_cache[data_index].trickle, ts_start_time + timestamp);
            vh_order_update(0);
        }
        
