NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
        return VH_DATA_STATUS_OLD;
    }
    else if (delta == 0)
    {
        
        /* the incoming packet has the same version as the current */
        if (data_index == DATA_CACHE_ENTRY_INVALID)
        {
            /* no entry, no way of proving conflict */
            return VH_DATA_STATUS_SAME;
        }

        if (p_adv_data->version > 0 &&
            cache_hit &&
            payload_has_conflict(mesh_packet_adv_data_get(m_data_cache[data_index].p_packet), p_adv_data))
        {
            trickle_rx_inconsistent(&m_data_cache[data_index].trickle, ts_start_time + timestamp);
            vh_order_update(0);
            return VH_DATA_STATUS_CONFLICTING;
        }
        else
        {   
            trickle_rx_consistent(&m_data_cache[data_index].trickle, ts_start_time + timestamp);
            return VH_DATA_STATUS_SAME;
        }
    }
    else
    {
        /* didn't know this value before, should start retransmitting it */
        if (data_index == DATA_CACHE_ENTRY_INVALID)
        {
            data_index = data_entry_allocate();

            /* associate with handle */
            m_handle_cache[handle_index].data_entry = data_index;
        }
        else
        {
            /* free old packet */
            mesh_packet_ref_count_dec(m_data_cache[data_index].p_packet); /* remove data cache ref */
            cache_hit = true;
        }

        /* store new packet in data cache */

        mesh_packet_take_ownership(p_packet);
        mesh_packet_ref_count_inc(p_packet); /* ref in data cache */
        m_data_cache[data_index].p_packet = p_packet;
        trickle_rx_inconsistent(&m_data_cache[data_index].trickle, ts_start_time + timestamp);
        vh_order_update(0);
        
        if (cache_hit)
        {
            return VH_DATA_STATUS_UPDATED;
        }
        else
        {
            return VH_DATA_STATUS_NEW;
        }
    }
    
}

vh_data_status_t vh_local_update(rbc_mesh_value_handle_t handle, uint8_t* data, uint8_t length)
{
    if (!m_is_initialized)
        return VH_DATA_STATUS_UNKNOWN;
    
    cache_task_t task;
    task.type = CACHE_TASK_TYPE_LOCAL_UPDATE;
    task.handle = handle;
    
    uint32_t error_code;
    
    if (!mesh_packet_acquire(&task.params.local_update.p_packet))
    {
        return VH_DATA_STATUS_UNKNOWN;
    }
    
    error_code = mesh_packet_build(task.params.local_update.p_packet,
            handle,
            0, /* !!! TEMPORARY, as we can't know before the task is handled */
            data,
            length);
    if (error_code != NRF_SUCCESS)
    {
        return VH_DATA_STATUS_UNKNOWN;
    }

    error_code = handle_task_push(&task);
    if (error_code != NRF_SUCCESS)
    {
        mesh_packet_ref_count_dec(task.params.local_update.p_packet);
        return VH_DATA_STATUS_UNKNOWN;
    }
    return VH_DATA_STATUS_UPDATED;
}

uint32_t vh_on_timeslot_begin(void)
{
    return vh_order_update(TIMESLOT_STARTUP_DELAY_US);
}

uint32_t vh_order_update(uint64_t time_now)
{
    /* handle expired trickle timers */
    async_event_t tx_event;
    tx_event.type = EVENT_TYPE_TIMER;
    tx_event.callback.timer.cb = transmit_all_instances;
    tx_event.callback.timer.timestamp = time_now;
    return event_handler_push(&tx_event);
}

uint32_t vh_value_get(rbc_mesh_value_handle_t handle, uint8_t* data, uint16_t* length)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }
    
    uint16_t data_index = m_handle_cache[handle_index].data_entry;
    if (data_index == DATA_CACHE_ENTRY_INVALID || m_data_cache[data_index].p_packet == NULL)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

    mesh_adv_data_t* p_adv_data = mesh_packet_adv_data_get(m_data_cache[data_index].p_packet);

    /* don't exceed the supplied length, as this will overflow the buffer */
    if (*length > p_adv_data->adv_data_length - MESH_PACKET_ADV_OVERHEAD)
    {
        *length = p_adv_data->adv_data_length - MESH_PACKET_ADV_OVERHEAD;
    }

    /* make copy */
    memcpy(data, p_adv_data->data, *length);

    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

uint32_t vh_tx_event_set(rbc_mesh_value_handle_t handle, bool do_tx_event)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);

    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

    m_handle_cache[handle_index].tx_event = do_tx_event;

    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

uint32_t vh_tx_event_flag_get(rbc_mesh_value_handle_t handle, bool* is_doing_tx_event)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

    *is_doing_tx_event = m_handle_cache[handle_index].tx_event;

    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

int16_t vh_get_version_delta(uint16_t old_version, uint16_t new_version)
{
    /* utility function */
    if (old_version < MESH_VALUE_LOLLIPOP_LIMIT)
    {
        return (((int32_t)old_version + INT16_MAX) > ((int32_t)new_version)) ?
            (new_version - old_version) :
            (INT16_MAX);
    }
    else if (new_version < MESH_VALUE_LOLLIPOP_LIMIT)
    {
        return (((int32_t)new_version + INT16_MAX) > ((int32_t)old_version)) ?
            (new_version - old_version) :
            (INT16_MIN);
    }
    else
    {
        const uint32_t separation = (new_version >= old_version)?
            (new_version - old_version) :
            (old_version - new_version);

        if (separation > INT16_MAX)
        {
            if (old_version > new_version)
            {
                old_version += MESH_VALUE_LOLLIPOP_LIMIT;
            }
            else
            {
                new_version += MESH_VALUE_LOLLIPOP_LIMIT;
            }
        }

        return (new_version - old_version);
    }
}

uint32_t vh_value_enable(rbc_mesh_value_handle_t handle)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;
    cache_task_t task;
    
    task.type = CACHE_TASK_TYPE_ENABLE;
    task.handle = handle;
    uint32_t error_code;
    
    if (!mesh_packet_acquire(&task.params.enable.p_packet))
    {
        return NRF_ERROR_NO_MEM;
    }
    
    /* build a dummy packet to request data, as we don't know the contents of the packet */
    error_code = mesh_packet_build(task.params.enable.p_packet,
            handle,
            0,
            NULL,
            0);
    if (error_code != NRF_SUCCESS)
    {
        mesh_packet_ref_count_dec(task.params.enable.p_packet); /* free the newly acquired packet */
        return NRF_ERROR_INTERNAL;
    }
    
    error_code = handle_task_push(&task);
    
    if (error_code != NRF_SUCCESS)
    {
        mesh_packet_ref_count_dec(task.params.enable.p_packet); /* free the newly acquired packet */
    }
    
    return error_code;
}

