NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
uint32_t vh_value_disable(rbc_mesh_value_handle_t handle)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

    uint16_t data_index = m_handle_cache[handle_index].data_entry;

    if (data_index != DATA_CACHE_ENTRY_INVALID)
    {
        trickle_disable(&m_data_cache[data_index].trickle);
    }

    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

uint32_t vh_value_is_enabled(rbc_mesh_value_handle_t handle, bool* p_is_enabled)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        *p_is_enabled = false;
        event_handler_critical_section_end();
        return NRF_SUCCESS;
    }

    uint16_t data_index = m_handle_cache[handle_index].data_entry;
    if (data_index == DATA_CACHE_ENTRY_INVALID)
    {
        *p_is_enabled = false;
        event_handler_critical_section_end();
        return NRF_SUCCESS;
    }

    *p_is_enabled = trickle_is_enabled(&m_data_cache[data_index].trickle);
    
    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

uint32_t vh_value_persistence_set(rbc_mesh_value_handle_t handle, bool persistent)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;
    
    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

        m_handle_cache[handle_index].persistent = persistent;

    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

uint32_t vh_value_persistence_get(rbc_mesh_value_handle_t handle, bool* p_persistent)
{
    if (!m_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    event_handler_critical_section_begin();
    
    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        event_handler_critical_section_end();
        return NRF_ERROR_NOT_FOUND;
    }

    *p_persistent = m_handle_cache[handle_index].persistent;
    
    event_handler_critical_section_end();
    return NRF_SUCCESS;
}

